### Configuring static routes 

router3(config)#ip route 192.168.1.0 255.255.255.0 10.0.23.1
router3(config)#ip route 10.0.12.0 255.255.25.252 10.0.23.1
%Inconsistent address and mask
router3(config)#ip route 10.0.12.0 255.255.255.252 10.0.23.1
router3(config)#ip route 192.168.4.0 255.255.255.0 10.0.34.1
%Invalid next hop address (it's this router)
router3(config)#ip route 192.168.4.0 255.255.255.0 10.0.34.2

### Displaying known and configured routes 
router3(config)#do sh ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/8 is variably subnetted, 5 subnets, 2 masks
S       10.0.12.0/30 [1/0] via 10.0.23.1
C       10.0.23.0/30 is directly connected, GigabitEthernet0/0/0
L       10.0.23.2/32 is directly connected, GigabitEthernet0/0/0
C       10.0.34.0/30 is directly connected, GigabitEthernet0/0/1
L       10.0.34.1/32 is directly connected, GigabitEthernet0/0/1
S    192.168.1.0/24 [1/0] via 10.0.23.1
S    192.168.4.0/24 [1/0] via 10.0.34.2
